{
  "compendium": {
    "version": 5,
    "race": [
      {
        "name": "Aarakocra",
        "size": "M",
        "speed": 25,
        "ability": "Dex 2, Wis 1",
        "trait": [
          {
            "name": "Flight",
            "text": "You have a flying speed of 50 feet. To use this speed, you can't be wearing medium or heavy armor."
          },
          {
            "name": "Talons",
            "text": "You are proficient with your unarmed strikes, which deal 1d4 slashing damage on a hit."
          },
          {
            "name": "Language",
            "text": "You can speak, read, and write Common, Aarakocra, and Auran."
          }
        ]
      },
      {
        "name": "Aasimar",
        "size": "M",
        "speed": 30,
        "ability": "Cha 2, Wis 1",
        "trait": [
          {
            "name": "Darkvision",
            "text": "Thanks to your celestial heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Celestial Resistance",
            "text": "You have resistance to necrotic damage and radiant damage."
          },
          {
            "name": "Celestial Legacy",
            "text": "You know the light cantrip. Once you reach 3rd level, you can cast the lesser restoration spell once with this trait, and you regain the ability to do so when you finish a long rest. Once you reach 5th level, you can cast the daylight spell once with this trait as a 3rd-level spell, and you regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Celestial."
          }
        ]
      },
      {
        "name": "Genasi (Air)",
        "size": "M",
        "speed": 30,
        "ability": "Con 2, Dex 1",
        "trait": [
          {
            "name": "Unending Breath",
            "text": "You can hold your breath indefinitely while you're not incapacitated."
          },
          {
            "name": "Mingle with the Wind",
            "text": "You can cast the levitate spell once with this trait, requiring no material components, and you regain the ability to cast it this way when you finish a long rest. Constitution is your spellcasting ability for this spell."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Primordial. Primordial is a guttural language, filled with harsh syllables and hard consonants."
          }
        ]
      },
      {
        "name": "Elf (Drow)",
        "size": "M",
        "speed": 30,
        "ability": "Dex 2, Cha 1",
        "proficiency": "Perception",
        "trait": [
          {
            "name": "Superior Darkvision",
            "text": "Accustomed to the depths of the Underdark, you have superior vision in dark and dim conditions. You can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Keen Senses",
            "text": "You have proficiency in the Perception skill."
          },
          {
            "name": "Fey Ancestry",
            "text": "You have advantage on saving throws against being charmed, and magic can't put you to sleep."
          },
          {
            "name": "Trance",
            "text": "Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is \"trance.\") While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires."
          },
          {
            "name": "Sunlight Sensitivity",
            "text": "You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight."
          },
          {
            "name": "Drow Magic",
            "text": "You know the dancing lights cantrip. When you reach 3rd level, you can cast the faerie fire spell once per day; you must finish a long rest in order to cast the spell again using this trait. When you reach 5th level, you can also cast the darkness spell once per day; you must finish a long rest in order to cast the spell again using this trait. Charisma is your spellcasting ability for these spells."
          },
          {
            "name": "Drow Weapon Training",
            "text": "You have proficiency with rapiers, shortswords, and hand crossbows."
          }
        ]
      },
      {
        "name": "Gnome (Deep)",
        "size": "S",
        "speed": 25,
        "ability": "Int 2, Dex 1",
        "trait": [
          {
            "name": "Superior Darkvision",
            "text": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Gnome Cunning",
            "text": "You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic."
          },
          {
            "name": "Stone Camouflage",
            "text": "You have advantage on Dexterity (stealth) checks to hide in rocky terrain."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common, Gnomish, and Undercommon. The svirfneblin dialect is more guttural than surface Gnomish, and most svirfneblin know only a little bit of Common, but those who deal with outsiders (and that includes you as an adventurer) pick up enough Common to get by in other lands."
          }
        ]
      },
      {
        "name": "Dragonborn",
        "size": "M",
        "speed": 30,
        "ability": "Str 2, Cha 1",
        "trait": [
          {
            "name": "Draconic Ancestry",
            "text": "You have draconic ancestry. Choose one type of dragon from the Draconic Ancestry table. Your breath weapon and damage resistance are determined by the dragon type, as shown in the table. (Player's Handbook p. 34)"
          },
          {
            "name": "Breath Weapon",
            "text": [
              "You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation.",
              "When you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level.",
              "After you use your breath weapon, you can't use it again until you complete a short or long rest."
            ]
          },
          {
            "name": "Damage Resistance",
            "text": "You have resistance to the damage type associated with your draconic ancestry."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Draconic. Draconic is thought to be one of the oldest languages and is often used in the study of magic. The language sounds harsh to most other creatures and includes numerous hard consonants and sibilants."
          }
        ]
      },
      {
        "name": "Genasi (Earth)",
        "size": "M",
        "speed": 30,
        "ability": "Con 2, Str 1",
        "trait": [
          {
            "name": "Earth Walk",
            "text": "You can move across difficult terrain made of earth or stone without expending extra movement."
          },
          {
            "name": "Merge with Stone",
            "text": "You can cast the pass without trace spell once with this trait, requiring no material components, and you regain the ability to cast it this way when you finish a long rest. Constitution is your spellcasting ability for this spell."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Primordial. Primordial is a guttural language, filled with harsh syllables and hard consonants."
          }
        ]
      },
      {
        "name": "Elf (Eladrin)",
        "size": "M",
        "speed": 30,
        "ability": "Dex 2, Int 1",
        "proficiency": "Perception",
        "trait": [
          {
            "name": "Darkvision",
            "text": "Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Keen Senses",
            "text": "You have proficiency in the Perception skill."
          },
          {
            "name": "Fey Ancestry",
            "text": "You have advantage on saving throws against being charmed, and magic can't put you to sleep."
          },
          {
            "name": "Trance",
            "text": "Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is \"trance.\") While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires."
          },
          {
            "name": "Elf Weapon Training",
            "text": "You have proficiency with the longsword, shortsword, shortbow, and longbow."
          },
          {
            "name": "Fey Step",
            "text": "You can cast the misty step spell once using this trait. You regain the ability to do so when you finish a short or long rest."
          }
        ]
      },
      {
        "name": "Genasi (Fire)",
        "size": "M",
        "speed": 30,
        "ability": "Con 2, Int 1",
        "trait": [
          {
            "name": "Darkvision",
            "text": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. Your ties to the Elemental Plane of Fire make your darkvision unusual: everything you see in darkness is in a shade of red."
          },
          {
            "name": "Fire Resistance",
            "text": "You have resistance to fire damage."
          },
          {
            "name": "Reach to the Blaze",
            "text": "You know the produce flame cantrip. Once you reach 3rd level, you can cast the burning hands spell once with this trait as a 1st-level spell, and you regain the ability to cast it this way when you finish a long rest. Constitution is your spellcasting ability for these spells."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Primordial. Primordial is a guttural language, filled with harsh syllables and hard consonants."
          }
        ]
      },
      {
        "name": "Gnome (Forest)",
        "size": "S",
        "speed": 25,
        "ability": "Int 2, Dex 1",
        "trait": [
          {
            "name": "Darkvision",
            "text": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Gnome Cunning",
            "text": "You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Gnomish. The Gnomish language, which uses the Dwarvish script, is renowned for its technical treatises and its catalogs of knowledge about the natural world."
          },
          {
            "name": "Natural Illusionist",
            "text": "You know the minor illusion cantrip. Intelligence is your spellcasting ability for it."
          },
          {
            "name": "Speak with Small Beasts",
            "text": "Through sounds and gestures, you can communicate simple ideas with Small or smaller beasts. Forest gnomes love animals and often keep squirrels, badgers, rabbits, moles, woodpeckers, and other creatures as beloved pets."
          }
        ]
      },
      {
        "name": "Goliath",
        "size": "M",
        "speed": 30,
        "ability": "Str 2, Con 1",
        "proficiency": "Athletics",
        "trait": [
          {
            "name": "Natural Athlete",
            "text": "You have proficiency in the Athletics skill."
          },
          {
            "name": "Stone's Endurance",
            "text": "You can focus yourself to occasionally shrug off injury. When you take damage, you can use your reaction to roll a d12. Add your Constitution modifier to the number rolled, and reduce the damage by that total. After you use this trait, you can't use it again until you finish a short or long rest."
          },
          {
            "name": "Powerful Build",
            "text": "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
          },
          {
            "name": "Mountain Born",
            "text": "You're acclimated to high altitude, including elevations above 20,000 feet. You're also naturally adapted to cold climates, as described in chapter 5 of the Dungeon Master's Guide."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Giant."
          }
        ]
      },
      {
        "name": "Half-Elf",
        "size": "M",
        "speed": 30,
        "ability": "Cha 2",
        "trait": [
          {
            "name": "Ability Score Increase",
            "text": "Two different ability scores of your choice increase by 1."
          },
          {
            "name": "Darkvision",
            "text": "Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Fey Ancestry",
            "text": "You have advantage on saving throws against being charmed, and magic can't put you to sleep."
          },
          {
            "name": "Skill Versatility",
            "text": "You gain proficiency in two skills of your choice."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common, Elvish, and one extra language of your choice."
          }
        ]
      },
      {
        "name": "Half-Orc",
        "size": "M",
        "speed": 30,
        "ability": "Str 2, Con 1",
        "proficiency": "Intimidation",
        "trait": [
          {
            "name": "Darkvision",
            "text": "Thanks to your orc blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Menacing",
            "text": "You gain proficiency in the Intimidation skill."
          },
          {
            "name": "Relentless Endurance",
            "text": "When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish a long rest."
          },
          {
            "name": "Savage Attacks",
            "text": "When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Orc. Orc is a harsh, grating language with hard consonants. It has no script of its own but is written in the Dwarvish script."
          }
        ]
      },
      {
        "name": "Elf (High)",
        "size": "M",
        "speed": 30,
        "ability": "Dex 2, Int 1",
        "proficiency": "Perception",
        "trait": [
          {
            "name": "Darkvision",
            "text": "Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Keen Senses",
            "text": "You have proficiency in the Perception skill."
          },
          {
            "name": "Fey Ancestry",
            "text": "You have advantage on saving throws against being charmed, and magic can't put you to sleep."
          },
          {
            "name": "Trance",
            "text": "Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is \"trance.\") While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common, Elvish, and one extra language of your choice. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires."
          },
          {
            "name": "Elf Weapon Training",
            "text": "You have proficiency with the longsword, shortsword, shortbow, and longbow."
          },
          {
            "name": "Cantrip",
            "text": "You know one cantrip of your choice from the wizard spell list. Intelligence is your spellcasting ability for it."
          }
        ]
      },
      {
        "name": "Dwarf (Hill)",
        "size": "M",
        "speed": 25,
        "ability": "Con 2, Wis 1",
        "trait": [
          {
            "name": "Darkvision",
            "text": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Dwarven Resilience",
            "text": "You have advantage on saving throws against poison, and you have resistance against poison damage."
          },
          {
            "name": "Dwarven Combat Training",
            "text": "You have proficiency with the battleaxe, handaxe, light hammer, and warhammer."
          },
          {
            "name": "Tool Proficiency",
            "text": "You gain proficiency with the artisan's tools of your choice: smith's tools, brewer's supplies, or mason's tools."
          },
          {
            "name": "Stonecunning",
            "text": "Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Dwarvish. Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak."
          },
          {
            "name": "Dwarven Toughness",
            "text": "Your hit point maximum increases by 1, and it increases by 1 every time you gain a level."
          }
        ]
      },
      {
        "name": "Human",
        "size": "M",
        "speed": 30,
        "ability": "Str 1, Dex 1, Con 1, Int 1, Wis 1, Cha 1",
        "trait": {
          "name": "Languages",
          "text": "You can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on."
        }
      },
      {
        "name": "Human (Variant)",
        "size": "M",
        "speed": 30,
        "trait": [
          {
            "name": "Ability Score Increase",
            "text": "Two different ability scores of your choice increase by 1."
          },
          {
            "name": "Skills",
            "text": "You gain proficiency in one skill of your choice."
          },
          {
            "name": "Feat",
            "text": "You gain one feat of your choice."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on."
          }
        ]
      },
      {
        "name": "Halfling (Lightfoot)",
        "size": "S",
        "speed": 25,
        "ability": "Dex 2, Cha 1",
        "trait": [
          {
            "name": "Lucky",
            "text": "When you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll."
          },
          {
            "name": "Brave",
            "text": "You have advantage on saving throws against being frightened."
          },
          {
            "name": "Halfling Nimbleness",
            "text": "You can move through the space of any creature that is of a size larger than yours."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Halfling. The Halfling language isn't secret, but halflings are loath to share it with others. They write very little, so they don't have a rich body of literature. Their oral tradition, however, is very strong. Almost all halflings speak Common to converse with the people in whose lands they dwell or through which they are traveling."
          },
          {
            "name": "Naturally Stealthy",
            "text": "You can attempt to hide even when you are obscured only by a creature that is at least one size larger than you."
          }
        ]
      },
      {
        "name": "Dwarf (Mountain)",
        "size": "M",
        "speed": 25,
        "ability": "Con 2, Str 2",
        "trait": [
          {
            "name": "Darkvision",
            "text": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Dwarven Resilience",
            "text": "You have advantage on saving throws against poison, and you have resistance against poison damage."
          },
          {
            "name": "Dwarven Combat Training",
            "text": "You have proficiency with the battleaxe, handaxe, light hammer, and warhammer."
          },
          {
            "name": "Tool Proficiency",
            "text": "You gain proficiency with the artisan's tools of your choice: smith's tools, brewer's supplies, or mason's tools."
          },
          {
            "name": "Stonecunning",
            "text": "Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Dwarvish. Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak."
          },
          {
            "name": "Dwarven Armor Training",
            "text": "You have proficiency with light and medium armor."
          }
        ]
      },
      {
        "name": "Shifter (Razorclaw)",
        "size": "M",
        "speed": 30,
        "ability": "Dex 2",
        "trait": [
          {
            "name": "Darkvision",
            "text": "Your lycanthropic heritage grants you the ability to see in dark conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Shifting",
            "text": [
              "On your turn, you can shift as a bonus action. Shifting lasts for 1 minute or until you end it on your turn as a bonus action.",
              "While shifting, you gain temporary hit points equal to your level + your Constitution bonus (minimum of 1). You also gain a feature that depends on your shifter subrace, described below.",
              "You must finish a short or long rest before you can shift again."
            ]
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Sylvan."
          },
          {
            "name": "Shifting Feature",
            "text": "While shifting, you can make an unarmed strike as a bonus action. You can use your Dexterity for its attack roll and damage bonus, and this attack deals slashing damage."
          }
        ]
      },
      {
        "name": "Gnome (Rock)",
        "size": "S",
        "speed": 25,
        "ability": "Int 2, Con 1",
        "trait": [
          {
            "name": "Darkvision",
            "text": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Gnome Cunning",
            "text": "You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Gnomish. The Gnomish language, which uses the Dwarvish script, is renowned for its technical treatises and its catalogs of knowledge about the natural world."
          },
          {
            "name": "Artificer's Lore",
            "text": "Whenever you make an Intelligence (History) check related to magic items, alchemical objects, or technological devices, you can add twice your proficiency bonus, instead of any proficiency bonus you normally apply."
          },
          {
            "name": "Tinker",
            "text": [
              "You have proficiency with artisan's tools (tinker's tools). Using those tools, you can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function after 24 hours (unless you spend 1 hour repairing it to keep the device functioning), or when you use your action to dismantle it; at that time, you can reclaim the materials used to create it. You can have up to three such devices active at a time.",
              "When you create a device, choose one of the following options:",
              "Clockwork Toy. This toy is a clockwork animal, monster, or person, such as a frog, mouse, bird, dragon, or soldier. When placed on the ground, the toy moves 5 feet across the ground on each of your turns in a random direction. It makes noises as appropriate to the creature it represents.",
              "Fire Starter. The device produces a miniature flame, which you can use to light a candle, torch, or campfire. Using the device requires your action.",
              "Music Box. When opened, this music box plays a single song at a moderate volume. The box stops playing when it reaches the song's end or when it is closed."
            ]
          }
        ]
      },
      {
        "name": "Halfling (Stout)",
        "size": "S",
        "speed": 25,
        "ability": "Dex 2, Con 1",
        "trait": [
          {
            "name": "Lucky",
            "text": "When you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll."
          },
          {
            "name": "Brave",
            "text": "You have advantage on saving throws against being frightened."
          },
          {
            "name": "Halfling Nimbleness",
            "text": "You can move through the space of any creature that is of a size larger than yours."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Halfling. The Halfling language isn't secret, but halflings are loath to share it with others. They write very little, so they don't have a rich body of literature. Their oral tradition, however, is very strong. Almost all halflings speak Common to converse with the people in whose lands they dwell or through which they are traveling."
          },
          {
            "name": "Stout Resilience",
            "text": "You have advantage on saving throws against poison, and you have resistance against poison damage."
          }
        ]
      },
      {
        "name": "Tiefling (Infernal)",
        "size": "M",
        "speed": 30,
        "ability": "Cha 2, Int 1",
        "trait": [
          {
            "name": "Darkvision",
            "text": "Thanks to your infernal heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Hellish Resistance",
            "text": "You have resistance to fire damage."
          },
          {
            "name": "Infernal Legacy",
            "text": "You know the thaumaturgy cantrip. Once you reach 3rd level, you can cast the hellish rebuke spell as a 2nd-level spell; you must finish a long rest in order to cast the spell again using this trait. Once you reach 5th level, you can also cast the darkness spell; you must finish a long rest in order to cast the spell again using this trait. Charisma is your spellcasting ability for these spells."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Infernal."
          },
          {
            "name": "Feral (Variant)",
            "text": "Your Intelligence score increases by 1, and your Dexterity score increases by 2. This replaces the Ability Score Increase trait."
          },
          {
            "name": "Variant Features (Choose 1)",
            "text": [
              "Devil's Tongue.",
              "You know the vicious mockery cantrip. When your reach 3rd level, you can cast the charm person spell as a 2nd-level spell once with this trait. When you reach 5th level, you can cast the enthrall spell once with this trait. You must finish a long rest to cast these spells once again with this trait. Charisma is your spellcasting ability for them. This trait replaces the Infernal Legacy trait.",
              "Hellfire.",
              "Once you reach 3rd level, you can cast the burning hands spell once per day as a 2nd-level spell. This trait replaces the hellish rebuke spell of the Infernal Legacy trait.",
              "Winged.",
              "You have bat-like wings sprouting form your shoulder blades. You have a flying speed of 30 feet. This trait replaces the Infernal Legacy trait."
            ]
          },
          {
            "name": "Appearance (Variant)",
            "text": "Your tiefling might not look like other tieflings. Rather than having the physical characteristics described in the Player's Handbook, choose 1d4 + 1 of the following features: small horns; fangs or sharp teeth; a forked tongue; catlike eyes; six fingers on each hand; goatlike legs; cloven hoofs; a forked tail; leathery or scaly skin; red or dark blue skin; cast no shadow or reflection; exude a smell of brimstone"
          }
        ]
      },
      {
        "name": "Genasi (Water)",
        "size": "M",
        "speed": 30,
        "ability": "Con 2, Wis 1",
        "trait": [
          {
            "name": "Acid Resistance",
            "text": "You have resistance to acid damage."
          },
          {
            "name": "Amphibious",
            "text": "You can breathe air and water."
          },
          {
            "name": "Swim",
            "text": "You have a swimming speed of 30 feet."
          },
          {
            "name": "Call to the Wave",
            "text": "You know the shape water cantrip. When you reach 3rd level, you can cast the create or destroy water spell as a 2nd-level spell once with this trait, and you regain the ability to cast it this way when you finish a long rest. Constitution is your spellcasting ability for these spells."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Primordial. Primordial is a guttural language, filled with harsh syllables and hard consonants."
          }
        ]
      },
      {
        "name": "Shifter (Wildhunt)",
        "size": "M",
        "speed": 30,
        "ability": "Dex 1, Wis 1",
        "trait": [
          {
            "name": "Darkvision",
            "text": "Your lycanthropic heritage grants you the ability to see in dark conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Shifting",
            "text": [
              "On your turn, you can shift as a bonus action. Shifting lasts for 1 minute or until you end it on your turn as a bonus action.",
              "While shifting, you gain temporary hit points equal to your level + your Constitution bonus (minimum of 1). You also gain a feature that depends on your shifter subrace, described below.",
              "You must finish a short or long rest before you can shift again."
            ]
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Sylvan."
          },
          {
            "name": "Shifting Feature",
            "text": "While shifting, you gain advantage on all Wisdom-based checks and saving throws."
          }
        ]
      },
      {
        "name": "Elf (Wood)",
        "size": "M",
        "speed": 35,
        "ability": "Dex 2, Wis 1",
        "proficiency": "Perception",
        "trait": [
          {
            "name": "Darkvision",
            "text": "Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Keen Senses",
            "text": "You have proficiency in the Perception skill."
          },
          {
            "name": "Fey Ancestry",
            "text": "You have advantage on saving throws against being charmed, and magic can't put you to sleep."
          },
          {
            "name": "Trance",
            "text": "Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is \"trance.\") While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires."
          },
          {
            "name": "Elf Weapon Training",
            "text": "You have proficiency with the longsword, shortsword, shortbow, and longbow."
          },
          {
            "name": "Fleet of Foot",
            "text": "Your base walking speed increases to 35 feet."
          },
          {
            "name": "Mask of the Wild",
            "text": "You can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena."
          }
        ]
      },
      {
        "name": "Dwarf (Duergar)",
        "size": "M",
        "speed": 25,
        "ability": "Con 2, Str 1",
        "trait": [
          {
            "name": "Superior Darkvision",
            "text": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Duergar Resilience",
            "text": "You have advantage on saving throws against poison, and you have resistance against poison damage. You also have advantage on saving throws against illusions and against being charmed or paralyzed."
          },
          {
            "name": "Dwarven Combat Training",
            "text": "You have proficiency with the battleaxe, handaxe, light hammer, and warhammer."
          },
          {
            "name": "Tool Proficiency",
            "text": "You gain proficiency with the artisan's tools of your choice: smith's tools, brewer's supplies, or mason's tools."
          },
          {
            "name": "Stonecunning",
            "text": "Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common, Dwarvish, and Undercommon."
          },
          {
            "name": "Duergar Magic",
            "text": "When you reach 3rd level, you can cast the Enlarge/Reduce spell on yourself once with this trait, using only the spell's enlarge option. When reach 5th level, you can cast the Invisibility spell on yourself once with this trait. You don't need material components for either spell, and you can't cast them while you're in direct sunlight, although sunlight has no effect on them once cast. You regain the ability to cast these spells with this trait when you finish a long rest. Intelligence is your spellcasting ability for these spells."
          },
          {
            "name": "Sunlight Sensitivity",
            "text": "You have disadvantage on attack rolls and Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight."
          }
        ]
      },
      {
        "name": "Half-Elf (Wood Elf Descent)",
        "size": "M",
        "speed": 30,
        "ability": "Cha 2",
        "trait": [
          {
            "name": "Ability Score Increase",
            "text": "Two different ability scores of your choice increase by 1."
          },
          {
            "name": "Darkvision",
            "text": "Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Fey Ancestry",
            "text": "You have advantage on saving throws against being charmed, and magic can't put you to sleep."
          },
          {
            "name": "Variant Feature (Choose 1)",
            "text": [
              "Keen Senses",
              "You have proficiency in the Perception skill",
              "Elf Weapon Training",
              "You have proficiency with the longsword, shortsword, shortbow, and longbow.",
              "Fleet of Foot",
              "Your base walking speed increases to 35 feet.",
              "Mask of the Wild",
              "You can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena."
            ]
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common, Elvish, and one extra language of your choice."
          }
        ]
      },
      {
        "name": "Half-Elf (Moon Elf or Sun Elf Descent)",
        "size": "M",
        "speed": 30,
        "ability": "Cha 2",
        "trait": [
          {
            "name": "Ability Score Increase",
            "text": "Two different ability scores of your choice increase by 1."
          },
          {
            "name": "Darkvision",
            "text": "Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Fey Ancestry",
            "text": "You have advantage on saving throws against being charmed, and magic can't put you to sleep."
          },
          {
            "name": "Variant Feature (Choose 1)",
            "text": [
              "Keen Senses",
              "You have proficiency in the Perception skill",
              "Elf Weapon Training",
              "You have proficiency with the longsword, shortsword, shortbow, and longbow.",
              "Cantrip",
              "You know one cantrip of your choice from the wizard spell list. Intelligence is your spellcasting ability for it."
            ]
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common, Elvish, and one extra language of your choice."
          }
        ]
      },
      {
        "name": "Half-Elf (Drow Descent)",
        "size": "M",
        "speed": 30,
        "ability": "Cha 2",
        "trait": [
          {
            "name": "Ability Score Increase",
            "text": "Two different ability scores of your choice increase by 1."
          },
          {
            "name": "Darkvision",
            "text": "Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Fey Ancestry",
            "text": "You have advantage on saving throws against being charmed, and magic can't put you to sleep."
          },
          {
            "name": "Variant Feature (Choose 1)",
            "text": [
              "Keen Senses",
              "You have proficiency in the Perception skill",
              "Drow Magic",
              "You know the dancing lights cantrip. When you reach 3rd level, you can cast the faerie fire spell once per day; you must finish a long rest in order to cast the spell again using this trait. When you reach 5th level, you can also cast the darkness spell once per day; you must finish a long rest in order to cast the spell again using this trait. Charisma is your spellcasting ability for these spells."
            ]
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common, Elvish, and one extra language of your choice."
          }
        ]
      },
      {
        "name": "Half-Elf (Aquatic Elf Descent)",
        "size": "M",
        "speed": 30,
        "ability": "Cha 2",
        "trait": [
          {
            "name": "Ability Score Increase",
            "text": "Two different ability scores of your choice increase by 1."
          },
          {
            "name": "Darkvision",
            "text": "Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
          },
          {
            "name": "Fey Ancestry",
            "text": "You have advantage on saving throws against being charmed, and magic can't put you to sleep."
          },
          {
            "name": "Variant Feature (Choose 1)",
            "text": [
              "Keen Senses",
              "You have proficiency in the Perception skill",
              "Swim",
              "You gain a swimming speed of 30."
            ]
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common, Elvish, and one extra language of your choice."
          }
        ]
      },
      {
        "name": "Halfling (Ghostwise)",
        "size": "S",
        "speed": 25,
        "ability": "Dex 2, Wis 1",
        "trait": [
          {
            "name": "Lucky",
            "text": "When you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll."
          },
          {
            "name": "Brave",
            "text": "You have advantage on saving throws against being frightened."
          },
          {
            "name": "Halfling Nimbleness",
            "text": "You can move through the space of any creature that is of a size larger than yours."
          },
          {
            "name": "Languages",
            "text": "You can speak, read, and write Common and Halfling. The Halfling language isn't secret, but halflings are loath to share it with others. They write very little, so they don't have a rich body of literature. Their oral tradition, however, is very strong. Almost all halflings speak Common to converse with the people in whose lands they dwell or through which they are traveling."
          },
          {
            "name": "Silent Speech",
            "text": "You can speak telepathically to any creature within 30 feet of you. The creature understands you only if the two of you share a language. You can speak telepathically in this way to one creature at a time."
          }
        ]
      }
    ]
  }
}